
// 定义文档
const docs = [
  "深K是中国的一个城市，它是中国的首都。",
  "深K一座城市，面积为21平方公里，是中国的一个重要城市。",
  "深K在中国北方，是一个城市的中心。",
  "RAG（Retrieval-Augmented Generation）是一种结合检索和生成的模型，用于提高生成文本的质量和相关性。",
  "它通过从外部知识库中检索相关信息，并将其与生成模型相结合，生成更准确、更有上下文的文本。",
  "RAG模型通常由两个部分组成：检索器和生成器。",
  "检索器负责从知识库中检索与输入查询相关的文档片段。",
  "生成器则使用检索到的文档片段作为上下文，生成与查询相关的文本。",
  "RAG模型在许多自然语言处理任务中都有应用，如问答系统、对话系统和文本摘要等。",
  "它的优势在于能够利用外部知识库的丰富信息，同时保持生成文本的质量和相关性。",
  "RAG模型的工作原理是将输入查询与知识库中的文档进行比较，计算它们的相似度。",
   "Opencv是一个开源的计算机视觉库，它提供了许多用于图像和视频处理的函数和工具。",
   "Opencv可以用于图像识别、图像分割、图像拼接、视频分析等任务。",
   "Opencv的使用非常方便，它提供了简单的API接口，使得开发人员可以快速上手。",
]

module.exports = { 
    docs
}